print('โปรแกรมคำนวณทางผ่านมอเตอร์เวย์')
print('-----------------------------------------')
print('รถยนต์ 4 ล้อ กด : 1')
print('รถยนต์ 6 ล้อ กด : 2')
print('รถยนต์มากกว่า 6 ล้อ กด : 3')
print('-----------------------------------------')
x = int(input('เลือกประเภทยานพาหนะ'))
y = ['ค่าบริการรถยนต์ 4 ล้อ' , 'ค่าบริการรถยนต์ 6 ล้อ' , 'ค่าบริการรถยนต์มากกว่า 6 ล้อ']
i = (x)-1
print(y[i])
list1 = ['25 บาท' , '30 บาท' , '45 บาท' , '55 บาท' , '60 บาท']
list2 = ['45 บาท' , '45 บาท' , '75 บาท' , '90 บาท' , '100 บาท']
list3 = ['60 บาท' , '70 บาท' , '110 บาท' , '130 บาท' , '140 บาท']
thislist = [list1 , list2 , list3]
waylist = ['ลาดกระบัง ---> บางบ่อ' , 'ลาดกระยัง ---> บางประกง' , 'ลาดกระบัง ---> พนัสนิคม' , 'ลาดกระบัง ---> บ้านบึง' , 'ลาดกระบัง ---> บางพระ']
print(waylist[0] , thislist[i][0] )
print(waylist[1] , thislist[i][1] )
print(waylist[2] , thislist[i][2] )
print(waylist[3] , thislist[i][3] )
print(waylist[4] , thislist[i][4] )