#list เก็บข้อมูลได้ทั้ง str int
thislist = ['songpon' , 'prathumma' , '673050383-1' , '19' , '080-980-9799' , 'khonkaen']
print(thislist[-2]) #[ตามด้วยตำแหน่งต่างๆ]เพื่อสั่ง print แค่เฉพาะข้อความนั้นๆ
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
print(thislist[1:3]) #เริ่มนับตั้งแต่ index1 ถึง index3 โดยไม่นับindex3
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist[0] = 'me and you' #เป็นการเปลี่ยนค่ำแหน่งเดียวภายใน list
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist.append('hello') #appendเป็นการเพิ่มข้อความต่อไปของจากอันล่าสุด
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist.append(input('input list : ')) #เป็นการเพิ่มข้อความต่อท้ายโดยการ input เข้ามา
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist.insert(2 , 'here') #เป็นการแทรกเข้ามาแทนที่
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist.remove('you') #เป็นการนำข้อความที่ต้องการออก
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
del thislist[0] #เป็นการเอาออกแค่ตำแหน่งที่ระบุไว้ออก
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
thislist.clear() #เป็นการเคลีย list ออก ไม่ได้ลบออก แต่ clear ออก
print(thislist)
print('----------------------------------------------------------------------------------')

thislist = ['me' , 'you' , 'us' , 'love']
del thislist #เป็นการเอาออกทั้งหมด
print(thislist)
print('----------------------------------------------------------------------------------')