thisset = {'1' , '2' , '3'}
print(thisset) #print ออกมาแบบสุ่มตำแหน่ง
print('----------------------------------------------------------------------------------')


thisset = {'1' , '2' , '3'}
for x in thisset :
    print(x)
    print('----------------------------------------------------------------------------------')

    
thisset = {'1' , '2' , '3'}
thisset.add('hello') #เพิ่มเข้าไปตัวเดียว
print(thisset)
thisset.update(['hi' , 'hola' , 'yaho']) #เพิ่มเข้าไปทีละ 3 ตัว
print(thisset)
print('----------------------------------------------------------------------------------')

thisset = {'1' , '2' , '3'}
thisset.remove('1') #เอาออก
thisset.discard('2') #เอาออก
thisset.clear() #เคลียออก
#del thsiset เป็นการลบออกทั้งหมด