thistuple = ('1' , '2' , '3')
print(thistuple)
print('----------------------------------------------------------------------------------')

thistuple = ('1' , '2' , '3')
print(thistuple[1]) #print เฉพาะข้อมูลที่กำหนดให้ปลิ้น
print('----------------------------------------------------------------------------------')

x = ('com' , 'ED' , 'KKU')
y = list(x)
x = tuple(y)
print(x)
print('----------------------------------------------------------------------------------')

x = ('com' , 'ED' , 'KKU')
del x
print(x) #ถ้าใส่ del ก็สามารถลบออกได้ทั้งบรรทัดได้
print('----------------------------------------------------------------------------------')